Tekla.Structures.Model.Load
The Load class is an abstract base class for all loads.

Tekla.Structures.Model.Load._Group
Load _Group object for this load. Id contains the db id in ts side

Tekla.Structures.Model.Load.FatherId
The identifier of the father object that the load is attached to.

Tekla.Structures.Model.Load.Spanning
The load spanning.

Tekla.Structures.Model.Load.PrimaryAxisDirection
The vector for the primary axis direction.

Tekla.Structures.Model.Load.AutomaticPrimaryAxisWeight
The automatic primary axis weight.

Tekla.Structures.Model.Load.Weight
The weight.

Tekla.Structures.Model.Load.LoadDispersionAngle
The load dispersion angle.

Tekla.Structures.Model.Load.CreateFixedSupportConditionsAutomatically
Indicates whether fixed support conditions are created automatically.

Tekla.Structures.Model.Load.LoadAttachment
The load attachment.

Tekla.Structures.Model.Load.PartNames
The part names.

Tekla.Structures.Model.Load.PartFilter
The part filter.

Tekla.Structures.Model.Load.BoundingBoxDx
The dimension of the bounding box in the X direction.

Tekla.Structures.Model.Load.BoundingBoxDy
The dimension of the bounding box in the Y direction.

Tekla.Structures.Model.Load.BoundingBoxDz
The dimension of the bounding box in the Z direction.

Tekla.Structures.Model.Load.Group
The load group object for the load.

Tekla.Structures.Model.Load.#ctor
Creates a new load instance.